{"title":"Apex Libraries","githubRepo":"Click-to-Cloud/website","googleAnalytics":"","index":{"title":"Home","description":"Have a glance at the fantastic libraries released and maintained by Click-to-Cloud.","content":" Query.apex Query.apex provides a flexible and dynamic way of building a SOQL query on the Salesforce platform. R.apex R.apex is a functional utility library for Apex. Script.apex Script.apex evaluates Javascript expressions in Apex. Moment.apex Moment.apex parses, manipulates and displays dates and times in Apex. Async.apex Async.apex is a promise-like functional library to handle asynchronous code. Job.apex Job.apex is a library that aims to easily create and manage Apex scheduled jobs. T.apex T.apex is simply the Swiss knife for unit testing in Apex. Mapper.apex Mapper.apex is a library to help converting one object to another. Flow.apex Flow.apex is a library to help you weave functions in a procedural style. Config.apex Config.apex is a library to manage your configurations and cache in an elegant way. Template.apex Template.apex is a library to evaluate templates written in visualforce expression syntax. Stream.apex Stream.apex is a library that streamlines your Funcs in Apex. Action.apex Action.apex is a tiny library that removes the pain points from Salesforce Lightning server controllers. Trap.apex Trap.apex is a versatile functional reactive library to handle Salesforce triggers. Log.apex Log.apex is a library to provide easy-to-use logging functionality to your app. Pack.apex Pack.apex is a tool to help you generate Func wrappers for existing Apex classes. Atom.apex Atom.apex is a library that tries to save you from the doom of Salesforce governor limits. Sweet.apex Sweet.apex is the next generation of Apex development, transpiling Sweet Apex(a feature-rich Apex-like code) to Apex classes. MObject.apex MObject.apex is a library to take care of persisting SObjects. G.apex G.apex is a library to set up GraphQL-lite features in Apex. ","srcFilePath":"src/pages/index.soy","id":"pages","location":"/./","url":"/./","children":{"docs":{"title":"Documentation","description":"Documentation","layout":"main","weight":1,"content":" {$page.title} | Project | Documentation | | ------- | ------------- | | Query.apex | Under Development | | R.apex | Docs | | Script.apex | Docs | | Moment.apex | Docs | | Async.apex | Docs | | Job.apex | Docs | | T.apex | Docs | | Mapper.apex | Docs | | Flow.apex | Docs | | Config.apex | Docs | | Template.apex | Docs | | Stream.apex | Docs | | Action.apex | Under Development | | Trap.apex | Docs | | Log.apex | Docs | | Pack.apex | Under Development | | Atom.apex | Docs | | Sweet.apex | Docs | | MObject.apex | Docs | | G.apex | Docs | ","srcFilePath":"src/pages/docs/index.md","id":"docs","location":"/docs/","url":"/docs/"}},"childIds":["docs"]}}